    {
            "Barne Diseinuko Goi Mailako Arte Irakaskuntzetako Gradua": {
                "1": [
                    {
                        "izena": "Diseinuaren oinarriak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 10,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "Diseinuaren Oinarrizko Kontzeptuak Ulertzea: Ikasleak diseinuaren funtsezko elementuak bereganatzen ditu, hala nola forma, konposizioa, espazioa eta kolorea, hauek modu harmoniatsuan erabiltzeko.",
                            "Diseinu Prozesuaren Estrategiak Garatzea: Ideiak sortzeko eta garatzeko metodologia desberdinak erabiltzen dira, kontzeptu bat forma bisual bihurtzeko. ",
                            "Hizkuntza Grafikoaren Erabilera: Diseinuaren adierazpide bisualak ulertu eta erabiltzea, komunikazio grafiko argia eta eraginkorra lortzeko.",
                            "Materialen eta Tekniken Ezagutza eta Aplikazioa: Diseinu prozesuetan erabilitako material eta teknika desberdinak identifikatu eta praktikan jartzea.",
                            "Ikusizko Konposizioak Sortzea: Konposizio bisual orekatuak sortzeko gaitasuna garatzen da, forma, tamaina, kolore eta espazioaren arteko erlazioak ulertuz.",
                            "Sortze-Prozesuaren Ikerketa eta Esperimentazioa: Ikerketa eta esperimentazioaren bidez diseinu-soluzio berriak bilatzeko gaitasuna lantzen da.",
                            "Autokritika eta Ebaluazioa: Norberaren eta besteen lanak aztertzeko eta hobetzeko gaitasuna garatzen da, autokritika konstruktiboaren bidez."
							"Talde-Lanean Diseinu Proiektuak Garatzea: Taldeko lanetan parte hartuz, proiektuak era kolektiboan garatzeko trebetasunak indartzen dira."
                        ]
                    },
                    {
                        "izena": "Barnealdeen teknologia I",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 8,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "Irudikapenaren eta komunikazioaren adierazpen-hizkuntzak eta -baliabideak ondo erabiltzeko.",
                            "Bi dimentsioko irudikapenerako baliabide teknologikoak ondo baliatzeko.",
                            "Hiru dimentsioko irudikapenerako baliabide teknologikoak zein diren jakiteko.",
                            "Objektu arkitektonikoen oinplanoak irudikatzeko hizkuntza grafikoa ondo baliatzeko.",
                            "Objektu arkitektonikoen altxaerak irudikatzeko hizkuntza grafikoa ondo baliatzeko.",
                            "Objektu arkitektonikoen sekzioak irudikatzeko hizkuntza grafikoa ondo baliatzeko.",
                            "Ikusmen espaziala garatzeko.",
                            "Neurketa-jarduera teknikoak eta orubeen zein eraikinen planoak egiteko.",
                            "Arkitektura-hizkuntza grafikoa jakiteko eta irudikatzeko zein proiektatzeko ondo erabiltzeko.",
                            "Irudikapen grafikoak ordenatuta, garbi eta zehatz garatzeko."
                        ]
                    },
                    {
                        "izena": "Materialak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
						"currentOfficialRAs": [
                            "Barne diseinuan erabilitako materialen ezaugarriak ezagutzea.",
                            "Barne diseinuan erabilitako materialen propietate fisikoak eta kimikoak ezagutzea.",
                            "Barne diseinuan erabilitako materialen propietate mekanikoak ezagutzea.",
                            "Barne diseinuan erabilitako materialen propietate termoteknikoak ezagutzea.",
                            "Barne diseinuan erabilitako materialen propietate akustikoak ezagutzea.",
                            "Materialen portaera eta egokitasuna ebaluatzea barne-diseinuko proiektuetan.",
                            "Ekoizpen- eta eraldatze-prozesuak ulertzea.",
                            "Materialen erabilera jasangarria eta ingurumen-inpaktua kontuan hartzea.",
                            "Materialen berrikuntzak eta joerak aztertzea.",
                            "Materialak hautatzeko irizpideak garatzea, proiektuaren beharren arabera."
						]
                    },
                    {
                        "izena": "Marrazketa artistikoa",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
						"currentOfficialRAs": [
                            "Trazua eta Marrazketa: Ikasleak esku hutsezko marrazkian trebetasuna eskuratzen du, marrazkiaren egitura, tentsioak, keinua, mugimendua eta masa atzematen ditu."
							"Ahokadura eta Espazioaren Eraikuntza: Formen ahokadura, eraikuntza egokia eta kokapen espaziala lantzen ditu, elementu sinple eta konplexuen arteko proportzioak ulertuz."
							"Arte-Konposizioaren Harmonia: Arte-konposizioetan parte hartzen duten proportzio, lerro, kolore eta bestelako faktoreen konbinazio harmonikoa identifikatzen du."
							"Perspektiba eta Errepresentazioa: Errealitatearen errepresentazioan eta beharretara egokitutako perspektiba koniko mota desberdinak bereizten ditu eta aplikatzen ditu."
							"Irudikapen Plastikoa eta Espazioaren Pertzepzioa: Forma naturaletatik abiatuta, espazio-dimentsioak dituzten irudikapen plastiko pertsonalak sortzen ditu."
							"Errealitatetik Adierazpenera: Errealitatetik abiatutako trebetasun plastikoak garatzen ditu, interpretazio artistikorako gaitasuna sustatuz."
							"Hizkuntza Formala eta Sinbolikoa: Hizkuntza formala, sinbolikoa eta funtzionaltasun espezifikoa erlazionatzen ditu irudikapen lanetan."
							"Irudiaren eta Espazioaren Pertzepzioa: Irudiaren, materiaren eta espazioaren pertzepzioari buruzko ikuspegi zientifikoa eskuratzen du."
							"Marrazketaren Elementuen Azterketa: Irudikapenaren elementuak aztertzen eta ikertzen ditu, hala nola forma, tonu-balorazioa, orbana, lerroa, testura, espazioa eta perspektiba."
							"Lerroaren Forma eta Adierazkortasuna: Marrazketan lerroaren forma, proportzioak eta adierazkortasuna behatzen eta garatzen ditu.",
						]	
					},
                    {
                        "izena": "Irudikapen sistemak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
						"currentOfficialRAs": [
                            "Objektu grafiko zein arkitektonikoen egitura geometrikoa identifikatzen du eta haien oinarrizko elementuak adierazten, irudikapenaren eta komunikazioaren adierazpen-hizkuntzak, baliabideak, tresnak eta materiala ondo erabiliz."
							"Geometria lauko problema konplexuak eta eraldaketak ebazten ditu baita diseinatu ere, leku geometrikoak zehaztuz eta eskalara egokienean erreproduzituz, grafikoki adieraziz erabilitako eraikuntza lagungarria, lotura puntuak eta haien elementuen erlazioak."
							"Espazio errealetik plano bidimentsionalera igarotzeko aukeratutako irudikapen-sistema aztertu, ulertu eta eraikitzen du, marrazkiaren bidez espazioa, piezak edo diseinua bere osotasunean definituz, irudikapenaren berezko hizkuntza eta sinbologia erabiliz, modu objektibo, argi eta zehatzean."
							"Analisi- eta sintesi-prozesua behar bezala egiten du, irudikapenaren eta neurketaren arazoari teknikoki aurre eginez."
							"Modu autonomo zein kooperatibotan lan egiten daki, partehartze egokia izanik, denboraren kudeaketa egokian garaiz eta dagokion eran entregatuz.",
						]	
                    },
                    {
                        "izena": "Teknologia digitala",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
						"currentOfficialRAs": [
                            "Ordenagailua erabiltzeko, proiektuak garatzeko bitartekoa baita."
							"Sistema eragileen ezaugarriak zein diren eta haien sare-erabilera nolakoa den jakiteko."
							"Koordenatuetan oinarritutako marrazketa bektorialeko programa teknikoak ondo erabiltzeko."
							"Bezier kurbetan oinarritutako arte-aplikazio grafiko bektorialak ondo erabiltzeko."
							"Programa informatikoetako funtziorik garrantzitsuenak ondo baliatzeko."
							"Irudi bektorialaren alderdi teknikoak eta jatorrizko formatuak zein truke-formatuak ezagutzeko."
							"Aplikazioen arteko lan-fluxua kudeatzeko."
							"Artxibo digitalak antolatzeko, erabiltzaileek errazago balia ditzaten."
							"Gaitasunak handitzeko kanpoko zenbait baliabide erabiltzeko."
							"Bitarteko informatikoa bakoitzaren trebetasunak garatzeko erabiltzeko, egindako ikasketekin zerikusia dutenak bereziki."
							"Dokumentuak hartuko dituzten bitartekoen ezaugarri espezifikoak zein diren jakiteko, konfigurazio- eta esportazio-parametroak zehazteko."
							"Ikasgelako baliabideak eta materialak ondo erabiltzeko.",
						]	
                    },
                    {
                        "izena": "Oinarrizko kolorea",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINUAREN OINARRIAK",
						"currentOfficialRAs": [
                            "Kolorea Prozesuaren Aldagai Gisa Erabiltzea: Ikasleak kolorea proiektuen aldagai gisa aplikatzeko irizpidea garatzen du, formaren, kolorearen eta espazioaren arteko loturak ulertuz eta adierazpen grafikoan aplikatuz."
							"Kolorearen Aplikazioa Alderdi Psikologiko eta Kulturalean: Kolorea alderdi psikologiko eta kulturaletan aplikatzeko gaitasuna garatzen da, kolorearen sinbologiari eta komunikazio bisualari lotutako elementuak ezagutuz eta erabiltuz."
							"Kolorearen Antolaketa Bi eta Hiru Dimentsiotan: Ikasleak kolorea bi eta hiru dimentsiotan antolatzen ikasten du, forma eta espazioaren arteko erlazioak aztertuz eta aplikazio bisual praktikoetan txertatuz."
							"Kolore Teknikak eta Baliabide Digitalak: Ikasleak kolorea eskuzko tekniken bidez edo baliabide digitalekin nola aplikatu ikasten du, ñabardura kromatikoak eta harmoniak esperimentatuz eta sortuz."
							"Ideiak Diseinuarekin Lotzea eta Funtzionaraztea: Diseinuaren prozesuan kolorea nola erabili ulertzen da, ideia eta kontzeptuak modu eraginkorrean komunikatzeko teknikak eta material egokiak erabiliz."
							"Ikerketa eta Autokritika Gaitasuna: Banakako zein taldeko lanetan ikerketa eta autokritikarako gaitasuna garatzen da, sormena eta ikuspegi kritikoa bultzatuz eta proiektuetan aplikatuz.",
						]	
                    },
                    {
                        "izena": "Forma eta bolumena",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN OINARRIAK",
						"currentOfficialRAs": [
                            "Ikasleak materialei dagozkien lan-teknikak eta eraldaketa-prozesuak ezagutu, esperimentatu eta aplikatuko ditu."
							"Ikasleak hiru dimentsioko obrak egingo ditu, sentiberatasunez, ideia sortzaileetatik abiatuta."
							"Ikasleak hiru dimentsioko eta espazioko lanetan planteatutako arazo estetikoak, funtzionalak, teknikoak eta eraikuntzakoak konponduko ditu.",
						]	
                    },
                    {
                        "izena": "Arteen, arkitekturaren eta diseinuaren historia eta teoria",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN OINARRIAK",
                        "currentOfficialRAs": [
                            "Arteei eta Diseinuari buruzko Oinarrizko Kontzeptuak Jakitea eta Ulertzea: Ikasleak artearen eta diseinuaren oinarrizko kontzeptuak ezagutzen ditu, haien adierazpide garrantzitsuenak identifikatuz."
							"Arteen eta Diseinuaren Esanahia Historiaren Ikuspuntutik Ulertzea: Artelanen eta diseinu-lanen testuinguru historiko, ekonomiko, sozial eta kulturalak aztertzen eta ulertzen ditu."
							"Arteak eta Haiekin Zerikusia Duten Kontzeptuak Testuinguruan Kokatu eta Ulertzea: Artelanak eta diseinu-lanak zer testuingurutan sortu diren aztertzen eta ulertzen ditu, haien garapena interpretatuz."
							"Edertasun Kontzeptuak Erdi Aroan Izandako Garapena Bereizteko eta Ulertzeko: Erdi Aroko edertasunaren kontzeptua eta arte-adierazpenak bereizten eta aztertzen ditu, haien testuinguru historikoa ezagutuz."
							"Arteek eta Diseinuak Aro Modernoan Izandako Bilakaera Aztertzea: Aro Modernoko arte eta diseinuaren garapenean eragin handia izan duten kontzeptuak, lanak eta egileak identifikatzen ditu."
							"Aro Garaikideko Kontzeptu, Estilo eta Egile Garrantzitsuenak Bereizteko eta Ulertzeko: Aro Garaikidean garatutako arte- eta diseinu-mugimenduak aztertzen ditu, haien eragina eta esanahia ulertuz."
							"Sortze-Prozesuarekin Lotutako Oinarrizko Ikerketa eta Esperimentazio Metodoak Erabiltzea: Artelanen eta diseinu-lanen analisia egiteko eta interpretatzeko metodologia egokiak erabiltzen ditu."
							"Diziplinarteko Taldeetan Parte Hartzeko Gaitasuna Garatzea: Ikasitako edukiak beste arlo batzuekin uztartzen eta diziplinarteko talde-lanetan aplikatzen ikasten du."
							"Ikasitakoa Azaltzeko eta Transferitzeko Gaitasuna Garatzea: Artearen eta diseinuaren historiari buruzko ezagutzak komunikatzeko eta beste arlo batzuetan aplikatzeko gaitasuna garatzen du."
                        ]
                    },
                    {
                        "izena": "Diseinuari aplikatutako zientzia",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINUAREN OINARRIAK",
                        "currentOfficialRAs": [
                            "1. Metodo zientifikoa erabili errealitatea hobeto ulertzeko.",
                            "2. Hausnartu, elkarrizketan jardun eta errealitatearekiko espiritu kritikoa agertu.",
                            "3. Naturaren azterketa sistematikoa sustatu.",
                            "4. Begiratzeko, esperimentatzeko eta arrazoitzeko ahalmena landu.",
                            "5. Planteamendu, ekintza plan, ebaluazio prozesu eta zuzenketa irizpideak sortu, ebaluazioan lortutako emaitzen ondorio bezala.",
                            "6. Paralelismoak ezarri matematiketan, errealitatearen esperientzia fisikoarekiko independentea den giza pentsamenaren produktu bezala ulertuz.",
                            "7. Diseinua eta zientziaren arlo ezberdinen arteko erlazioak ezagutu.",
                            "8. Diziplinarteko taldetan lan egin.",
                            "9. Sormena bultzatu.",
                            "10. Ahalegin ahalmena garatu."
                        ]
                    }
                ],
                "2":[
                    {
                        "izena": "Proiektuak I",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 9,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "prerequisiteRAs": [
                            "('Diseinuaren oinarriak'-tik) Oinarrizko konposizio bisuala sortzen du.",
                            "('Forma eta bolumena'-tik) Oinarrizko formak hiru dimentsiotan irudikatzen ditu.",
                            "('Irudikapen sistemak'-tik) Oinarrizko planoak (oinplanoa, altxaera) ulertzen ditu."
                        ],
                        "currentOfficialRAs": [
                            "Diseinu-proiektuak eta aurreproiektuak asmatzea eta planifikatzea, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Proiektuak garatzea, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Hizkuntza formalaren eta hizkuntza sinbolikoaren arteko erlazioa ulertzea."
							"Hizkuntza formalaren eta sinbolikoaren arteko erlazioak funtzionaltasun espezifikoan integratzea."
							"Ikerketa eta berrikuntza-estrategiak planteatzeko, funtzioetan, beharretan eta materialetan oinarritutako aukera berriei erantzutea."
							"Ingurumenaren ikuspuntutik iraunkorrak diren irtenbideak eta ongizaterako ideia berriak aurkitzea."
							"Giza dibertsitatearen barruan gizarteratzea eta berdintasuna sustatzea, pertsonen ezaugarri, trebetasun eta mugen arabera."
							"Komunikazio-prozesuaren hartzaileen portaera ezagutzea."
							"Komunikazio-modu guztien baliabide teknologikoak menderatzea."
							"Ikerketaren berezko prozedura metodologikoak menderatzea."
                        ]
                    },
                    {
                        "izena": "Proiektuak II",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 9,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "prerequisiteRAs": [
                            "('Proiektuak I'-tik) Espazio baten oinarrizko antolaketa funtzionala diseinatzen du.",
                            "('Proiektuak I'-tik) Proiektu bat oinarrizko planoekin komunikatzen du."
                        ],
                         "currentOfficialRAs": [
                            "Diseinu-proiektuak eta aurreproiektuak asmatzea eta planifikatzea, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Proiektuak garatzea, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Hizkuntza formalaren eta hizkuntza sinbolikoaren arteko erlazioa ulertzea."
							"Hizkuntza formalaren eta sinbolikoaren arteko erlazioak funtzionaltasun espezifikoan integratzea."
							"Ikerketa eta berrikuntza-estrategiak planteatzeko, funtzioetan, beharretan eta materialetan oinarritutako aukera berriei erantzutea."
							"Ingurumenaren ikuspuntutik iraunkorrak diren irtenbideak eta ongizaterako ideia berriak aurkitzea."
							"Giza dibertsitatearen barruan gizarteratzea eta berdintasuna sustatzea, pertsonen ezaugarri, trebetasun eta mugen arabera."
							"Komunikazio-prozesuaren hartzaileen portaera ezagutzea."
							"Komunikazio-modu guztien baliabide teknologikoak menderatzea."
							"Ikerketaren berezko prozedura metodologikoak menderatzea."
                        ]
                    },
                    {
                        "izena": "Barnealdeen teknologia II",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 8,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
                        "currentOfficialRAs": [
                            "Lantaldean bolumen sinpleak eta konposatuak grafikoki irudikatzeko irudikapen teknikoko sistemarik egokiena aukeratu izana argudiatzea."
							"Irudikapen teknikoko sistema zuzen	eta zehatz aplikatzea, lan-dokumentuetan bolumen sinpleak eta konposatuak grafikoki irudikatzeko."
							"Bolumenak eta espazioak irudikatzeko lanetan lantaldearen irudikapen teknikoko sistemak behar bezala erabiltzen direla berrikustea."
							"Barne-diseinuko proiektuen	diseinuan eta eraikuntza-xehetasunetan bolumenen eta espazioen benetako	magnitudea zehaztasunez	definitzea."
							"Maketa bat eraikitzeko garaian lantaldeak egindako irudikapen-sistemen bidez egindako irudikapenak dituzten planoak deskodetzeko."
							"Bolumen konposatuak diseinatzeko pentsamendu dibergentea erabiliz, formak eta espazioak buruz irudikatzea."
							"Irudikapen-sistemak proiektu- eta eraikuntza-planoen marrazketarekin lotzea, dokumentu teknikoen produkzioa ulertzeko eta erabiltzeko."
							"Espazioen konposizioarekin eta eraikuntza-xehetasunen ebazpenarekin lotzen diren problema geometrikoen aurrean irtenbide arrazoituak lantzea."
							"Argiak, itzalak eta islak zuzen irudikatu dokumentu grafikoak ulergarriak eta erakargarriak izan daitezen."
                        ]
                    },
                    {
                        "izena": "Diseinuaren kultura",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN OINARRIAK",
						"currentOfficialRAs": [
							"Diseinuak gizartean eta kultura garaikidean duen zeregina ulertzea."
							"Informazioa eta komunikazioa aztertzea diseinuaren esparru globalean: Formaren eta estetikaren teorian sakontzea:Diseinuaren funtzio praktikoa eta funtzio estetikoa aztertzea."
							"Artearen, artisautzaren eta diseinuaren arteko sinbiosia eta zeharkakotasuna ikertzea."
							"Antropologia eta ondare immaterialaren kontzeptuak diseinuan aplikatzea."
							"Kontsumoaren soziologiaren eta kulturaren oinarriak aztertzea."
							"Diseinuaren arloko ikerketa eta esperimentazioa sustatzea."
						]	
                    },
                    {
                        "izena": "Instalazio sanitarioak,
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
						"currentOfficialRAs": [
							"Instalazio sanitarioen oinarri fisikoak eta kimikoak ulertzea."
							"Terminologia jakiteko eta zenbait instalazio motatan dauden zatiak eta elementuak bereiztea."
							"Instalazio sanitarioetako materialek eta osagaiek zer ezaugarri dituzten eta nolako portaera duten jakitea."
							"Instalazio hauen oinarrian dagoen lege- eta araudi-esparrua ulertzea eta indarreko arauak betetzen dituzten irtenbideak ematea."
							"arnealdeen diseinu-proiektuak asmatzean eta garatzean espazioen kalitatea eta erabilera hobetzeko irizpideei jarraitzea."
							"Barnealdeen diseinu-proiektuarekin bat datozen irtenbide funtzional, formal eta teknikoak sortzea eta gauzatzea."
							"Proiektuak gauzatzeari buruzko informazioa aztertu, interpretatu, egokitu eta sortzea."
							"Metodologia eta proposamenak sektorearen berezko bilakaera teknologiko eta industrialera egokitzea."
							"Ingurumenaren ikuspuntutik iraunkorrak diren irtenbideak eta ongizaterako ideia berriak aurkitzea."
							"Prozesuak ezagutzea eta norberaren parte-hartzea beste profesionalenarekin koordinatzea, sekuentzien eta bateragarritasun-mailen arabera."
						]
                    },
                    {
                        "izena": "Elektrizitate eta komunikazio instalazioak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
							"currentOfficialRAs": [
							"Elektrizitate- eta komunikazio-instalazioen oinarri fisikoak ulertzea."
							"Terminologia jakitea eta zenbait instalazio motatan dauden zatiak eta elementuak bereiztea."
							"Elektrizitate eta komunikazio-instalazioetako materialek eta osagaiek zer ezaugarri dituzten eta nolako	portaera duten jakitea."
							"Instalazio hauen oinarrian dagoen lege eta araudi esparrua ulertzea eta indarreko arauak betetzen dituzten irtenbideak ematea."
							"Barnealdeen diseinu-proiektuak asmatzean eta garatzean espazioen kalitatea eta erabilera hobetzeko irizpideei jarraitzea."
							"Barnealdeen diseinu-proiektuarekin bat datozen irtenbide funtzional, formal eta teknikoak sortzea eta gauzatzea."
							"Proiektuak gauzatzeari buruzko informazioa aztertzea, interpretatzea, egokitzea eta sortzea."
							"Metodologia eta proposamenak sektorearen berezko bilakaera teknologiko eta industrialera egokitzea."
							"Ingurumenaren ikuspuntutik iraunkorrak diren irtenbideak eta ongizaterako ideia berriak aurkitzea."
							"Prozesuak ezagutzea eta norberaren parte-hartzea beste profesionalekin koordinatzea, sekuentzien eta bateragarritasun-mailen arabera."
						]
                    },
                    {
                        "izena": "Argazkilaritza eta ikusentzunezkoak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINUAREN OINARRIAK",
                        "currentOfficialRAs": [
                            "AOinarrizko Argazki-Kontzeptuak Ulertzea: Ikasleak argazkigintzaren funtsezko elementuak ezagutzen eta ulertzen ditu, hala nola konposizioa, argiztapena eta teknika fotografikoak."
							"Diseinu Arazoak Grafikoki Konpontzea: Konplexutasun tekniko txikiko lanetan diseinu-arazoak grafikoki konpontzeko gaitasuna garatzen du, irudiaren bidez komunikazio eraginkorra sortuz."
							"Argazkigintza Publizitarioaren Ezagutza: Publizitate-irudiaren testuinguruan argazkigintzari buruzko ezagutzak eskuratzen ditu, irudien funtzioa eta haien eragina aztertuz."
							"Argazkigintza Komertziala Garatzea: Publizitate-bodegoiaren, fotodiseinuaren eta produktuaren argazkigintzan aplikatutako tekniken erabilera menderatzen du."
							"Argazkiaren Aplikazioa Diseinu Grafikoan: Diseinu grafikoaren esparruko merkataritza-proiektu batean argazkia modu egokian aplikatzen ikasten du, mezu bisual argiak eta koherenteak sortuz."
							"Akabera Digitaleko Prozesuak Menderatzea: Amaierako irudiarekin bat datozen akabera digitaleko prozesuak ezagutzen eta aplikatzen ditu, irudiaren azken emaitza optimizatzeko."
							"Ikus-entzunezko Hizkuntza Aplikatzea: Argazkigintzan ikus-entzunezko hizkuntza koherentziaz aplikatzen du, ikus-entzunezko narratibaren funtsezko elementuak ezagutuz."
							"Argazkigintzako Teknologia Menderatzea: Argazkigintzan komunikazio-modu desberdinetarako baliabide teknologikoak menderatzen ditu, lan profesional batean aplikatzeko gaitasuna lortuz."
                        ]
                    },
                    {
                        "izena": "Barnealdeen diseinuaren historia",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN OINARRIAK",
                        "currentOfficialRAs": [
                            "Barnealdeen Diseinuaren eta Altzariaren Esanahia Historiaren Ikuspuntutik Ulertzea: Barne-diseinuaren eta altzariaren ekoizpenaren garapen historikoa aztertzen du, testuinguru ekonomiko, sozial eta kulturalaren arabera."
							"Barnealdeen Diseinuaren eta Altzarien Bilakaera Ezagutzea eta Ulertzea: Estilo, protagonista eta obra garrantzitsuenak identifikatzen ditu, haien garapena ulertuz eta interpretatuz."
							"Aro Garaikideko Barnealdeen eta Altzarien Diseinuaren Kontzeptu, Estilo eta Egile Garrantzitsuenak Ulertzea: Hizkuntza formalaren, sinbolikoaren eta funtzionaltasun espezifikoaren arteko erlazioak identifikatzen ditu."
							"Egungo Barne-Diseinuaren Estilo, Joera eta Protagonista Esanguratsuenak Ulertzea: Diseinuaren testuinguru ekonomiko, sozial eta kulturala ezagutzen du, eta diseinu garaikideko joerak eta eraginak aztertzen ditu."
							"Sentsibilitate Estetikoa eta Analisi Gaitasuna Garatzea: Barrualdeen diseinuaren eta altzarien ekoizpenaren azterketa sakona egiten du, ikuspegi estetikoa eta kritikoa garatuz."
							"Ikerketa eta Esperimentazio Metodoak Erabiltzea: Barne-diseinuaren eta altzariaren analisian sintesi-gaitasuna eta zentzu kritikoa erakusten ditu, baita diziplinarteko taldeetan parte hartzeko gaitasuna ere."
                        ]
                    },
                    {
                        "izena": "Antolamendua eta marketina",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
                        "currentOfficialRAs": [
                            "Ikasgaiari dagozkion ezagutza teorikoak eskuratzea.",
                            "Jabetza intelektualari eta industrialari buruzko legedia behar bezala interpretatzea.",
                            "Enpresaren kontzeptua, barne-funtzionamendua eta azpisistema funtzionalak definitzen dituzten ezaugarriak ulertzea.",
                            "Enpresen eta erakundeen marketinaren funtsezko elementuak identifikatzea.",
                            "Enpresen komunikazio-estrategietan murgilduz, harreman publikoak ezagutzea eta definitzea.",
                            "Marketineko ekitaldien antolamendua diseinatzea, epeak eta gauzatzeko modua zehaztuz, briefing-aren, irizpideen eta ezarritako aurrekontuaren arabera."
                        ]
                    },
					{
                        "izena": "Eraikuntza I",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 5,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "Eraikin bateko eraikuntza-elementuak bereiztea eta zertarako diren eta bana-banaka zein beste elementu batzuekiko erlazioan nola erantzuten duten jakitea."
							"Eraikin baten egituraren funtzionamenduaren oinarrizko alderdiak zein diren jakitea."
							"Egiturazko elementu txikiak kalkulatzea."
							"Eraikuntza-arloko terminologia jakitea."
							"Eraikuntza-prozesuetarako aukerak alderatzeko eta egokiena hautatzea."
							"Eraikuntzaren esparruan oinarri teorikoa eta praktikoa lortzea, lanbide-jardunean erabiltzeko."
							"Eraikuntza-arazoak eta -xehetasunak indarreko araudiaren arabera konpontzeko oinarrizko ezagutzak bereganatzea."
							"Eraikuntza-materialen eta -elementuen erabilerari eta aplikazioari lotutako ingurumen alderdiak zein diren jakitea."
							"Eskura dauden informazio-bideak erabiltzea, merkatuan dauden eraikuntza-materialez ikertzeko."
                        ]
                    },
                    {
                        "izena": "Eraikuntza II",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 5,
                        "arloa": "DERAIKUNTZA ETA TEKNOLOGIA",
						"currentOfficialRAs": [
                            "Eraikuntzan baliatzen diren iragazgaizte-sistemak eta isolamenduak zer diren eta nola erabiltzen diren jakitea."
							"Eraikinaren inguratzailea osatzen duten elementuei buruzko teoria eta praktika jakitea."
							"Eraikinak konpartimentutan zatitzeko eraikuntza-elementuak ondo erabiltzea."
							"Eraikin batean dauden mailen arteko komunikazioa konpontzea."
							"Eraikuntza-arloko terminologia jakitea."
							"Eraikuntza-prozesuetarako aukerak alderatzea eta egokiena hautatzea."
							"Eraikuntzaren esparruan oinarri teorikoa eta praktikoa lortzea, lanbide-jardunean erabiltzeko."
							"Eraikuntza-arazoak eta -xehetasunak indarreko araudiaren arabera konpontzeko oinarrizko ezagutzak bereganatzea."
							"Eraikuntza-materialen eta -elementuen erabilerari eta aplikazioari lotutako ingurumen alderdiak zein diren	jakitea."
							"Eskura dauden informazio-bideak erabiltzea, merkatuan dauden eraikuntza-materialez ikertzeko."
						]
					}
					],
                "3": [
                    {
                        "izena": "Proiektuak III",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 9,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "Proiektuak eta Aurreproiektuak Garatzea: Ikasleak proiektuak eta aurreproiektuak sortu eta garatzeko gaitasuna eskuratzen du, betebehar tekniko, funtzional, estetiko eta komunikatiboak kontuan hartuta."
							"Funtzioaren eta Formaren Arteko Loturak Ulertzea: Diseinuaren funtzionaltasuna eta estetika uztartuz, forma eta funtzioaren arteko erlazio egokiak identifikatzen ditu."
							"Adierazpen Grafikoa eta Formaren Arteko Lotura Ulertzea: Proiektuetan adierazpen bisuala egokia erabiltzen du, kontzeptu eta formaren arteko loturak ulertuz eta aplikatuz."
							"Ingurumen-iraunkortasunaren eta Giza Ongizatearen Ikuspuntutik Diseinatzea:	Diseinuak ingurumenarekiko eta giza ongizatearekiko errespetuzkoak izan daitezen, irtenbide jasangarriak bilatzen eta aplikatzen ditu."
							"Gaitasun Sintetikoa eta Bitartekaritza Garatzea: Diseinu proiektuetan ikuspegi sintetikoa lantzen du, arazoak konpontzeko eta elementu ezberdinen arteko harremanak kudeatzeko."
							"Ikerketa eta Ideiagintza Estrategiak Garatzea: Proiektuaren beharrak eta baldintzak ebazteko ikerketa-metodoak eta ideiagintza-teknikak erabiltzen ditu."
							"Proiektu Metodologiak Egokiro Hautatzea: Proiektu bakoitzerako metodologia egokia identifikatzen eta erabiltzen du, bere testuingurura egokituz."
							"Komunikazio Estrategiak Egiaztatzea eta Teknologia Egokitzea: Diseinuaren aurkezpen eta komunikazioan baliabide teknologiko egokiak erabiltzen ditu, teknologien bilakaerara egokituz."
							"Diseinuaren Egungo Joeretatik Ikastea eta Irtenbide Berriak Proposatzea: Egungo joerak aztertuz, etorkizuneko diseinu-eskakizunei erantzuteko proposamen berriak garatzen ditu."
							"Ikuspegi Metodologiko Egokien bidez Ikerketa Garatzea: Diseinu-prozesuetan ikerketa egokia aplikatzen du, metodologia sendoen bidez."
                        ]
                    },
                    {
                        "izena": "Proiektuak IV",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 9,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
						"currentOfficialRAs": [
							"Diseinu-proiektuak eta -aurreproiektuak asmatzeko eta planifikatzeko, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Proiektuak garatzeko, betebehar eta baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera."
							"Hizkuntza formalaren eta hizkuntza sinbolikoaren artean zer erlazio dauden ulertzeko."
							"Hizkuntza formalaren eta sinbolikoaren arteko erlazioak funtzionaltasun espezifikoan integratzeko."
							"Teknologiaren eta artearen, ideien eta helburuen, kulturaren eta merkataritzaren artean bitartekari aritzeko."
							"Ikerketa- eta berrikuntza-estrategiak planteatzeko, funtzioetan, beharretan eta materialetan oinarritutako aukera berriei erantzuteko."
							"Aldaketetara eta eboluzio teknologiko industrialera egokitzeko."
							"Gaur egun sortzen diren faktore sozialak, estetikoak eta artistikoak erabiltzeko etorkizuneko joerak bideratzeko."
							"Komunikazio-modu guztien baliabide teknologikoak ondo baliatzeko."
							"Ikerketaren berezko prozedura metodologikoak ondo baliatzeko."
							"Komunikazioaren eraginkortasuna egiaztatzeko metodoak erabiltzeko."
						]
                    },
                    {
                        "izena": "Lanbide orientazioa",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
							"Ikasgaiari dagozkion ezagutza teorikoak eskuratzea."
							"Lanaren lege-esparrua aztertzea eta interpretatzea, eta lan-harremanetatik eratortzen diren eskubideak eta betebeharrak ezagutzea."
							"Enpresa txiki edo ertain bat antolatzeko eta kudeatzeko lege-eskakizunak ezagutzea, produkzio-faktoreak, faktore juridikoak, merkataritzakoak eta gizarte- eta lan-arlokoak kontuan hartuta."
							"Lan-merkatuan eta etengabeko prestakuntzan sartzeko bideak identifikatzea, eta helburu horietara bideratutako erakunde instituzional, nazional eta komunitarioak ezagutzea."
							"Laneko segurtasunari eta higieneari buruzko arauak ulertzea eta aplikatzea, eta ingurumenarekiko babesarekiko sentikortasuna garatzea, bizi-kalitatearen faktore erabakigarri gisa."
						]
                    },
					 {
                        "izena": "Neurketak eta aurrekontuak I",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 3,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
							"Barne-diseinuarekin lotutako zerbitzu profesionalak modu pertsonalizatuan eta merkatuarekin bat etorriz tarifatzea."
							"Barne diseinuzko proiektuak eraikitzeko kostuak aurreikustea eta kuanfikatzea, proiektuaren inguruabarrek eskatzen duten konplexutasun-maila kontuan hartuta."
							"Eraikuntza-proiektuek eskatzen duten gaiari buruzko dokumentazioa prestatzea, eta Barne Diseinuaren zerbitzu profesionaletara egokitzea."
							"Arazoak modu autonomoan eta arduratsuan ebaztea."
							"Lankidetzan eta elkarlanean aritzea."
							"Datuak biltzean eta bahetzean oinarritutako dokumentazio propioa sortzea."
							"Egindako lanaren berri ematea, ahoz eta grafikoki,berariazko terminologia 3 hizkuntzetan erabiliz, bakoitzari dagokion mailan."
						]
                    },
                    {
                        "izena": "Neurketak eta aurrekontuak II",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 3,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
							"Barne-diseinuko proiektuak eraikitzeko kostuak aurreikustea eta kuantifikatzea, proiektuaren ezaugarriek eskatzen duten konplexutasun mailarekin."
							"Barne-diseinuko proiektu bati dagozkion obra-unitate berriak (prezio-oinarrietan ez daudenak) diseinatzea, prezio deskonposatuetan, deskribapenean, unitateetan eta obra-unitatearen kodean eraginez."
							"Eraikuntza-proiektuek behar duten arloko dokumentazioa prestatzea eta barne diseinuko zerbitzuetara egokitzea."
							"Arazoak modu autonomo eta arduratsuan konpontzea."
							"Lankidetzan eta elkarlanean aritzea."
							"Datu-bilketan eta -baheketan oinarritutako dokumentazio propioa sortzea"
						]
                    },
                    {
                        "izena": "Araudia eta diseinua",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
                        "currentOfficialRAs": [
                            "1. Komunikazio-modu guztien baliabide teknologikoak ondo baliatzeko.",
                            "2. Ingurumenaren ikuspuntutik iraunkorrak diren irtenbideak eta ongizaterako ideia berriak aurkitzeko.",
                            "3. Lege- eta araudi-esparrua ulertzeko eta indarreko arauak betetzen dituzten irtenbideak emateko.",
                            "4. Norberaren parte-hartzea beste profesionalenarekin koordinatzeko, sekuentziaren eta bateragarritasun-mailen arabera.",
                            "5. Araudietatik proiektuan eragina duena ateratzeko eta ateratakoa azken dokumentuan ondo adierazteko.",
                            "6. Nahitaez bete beharreko araudiari buruz ikuspuntu orokorra izateko eta proiektuan aplikatzeko.",
                            "7. Proiektuaren fase bakoitzari dagozkion alderdi arau-emaileen egiaztatze-fitxak ondo erabiltzeko.",
                            "8. Espazioen kalitatea eta erabilera hobetzeko irizpideak dituzten proiektuak sortzeko eta garatzeko.",
                            "9. Erabiltzailearen beharrak interpretatzeko eta hori dokumentazioan jasotzeko, aplikatu beharreko berme teknikoen eta legezko baldintzen barruan.)",
                            "10. Ezinbestean bete beharreko araudi-zerrenda bat proiektu-dokumentu gisa aurkezteko."
                        ]
                    },
                    {
                        "izena": "Segurtasuna eta osasuna",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
							"Obra baten parte diren agenteak idenfikatzea (bai EALn aipatutakoak, bai Laneko arriskuen prebentzioaren arloko erantzukizunak dituztenak)"
							"Barne Diseinuzko obra baten lan-arriskuak idenfikatzea eta plangintza (Atazak/faseak / Eragiketak) parte hartzen duten gremioak, erabili beharreko bitarteko osagarri, ekipo tekniko, material eta eraikuntza-sistemekin lotzea."
							"Barne Diseinuzko obra baten Laneko Arriskuen Prebentzioa ezartzea, prebentzio-ekintza egokiak aplikatuz, idenfikatutako lan arriskuak ezabatu edo murriztuz."
							"Arazoak modu autonomoan eta arduratsuan ebaztea."
							"Lankidetzan eta elkarlanean aritzea"
							"Datuak biltzean eta bahetzean oinarritutako dokumentazio propioa sortzea."
							"Barne diseinatzailearen lanbidea euskaraz jardun eta garatu ahal izateko gaur egungo egoera aztertu eta hura moldatzeko ekintzak diseinatu eta praktikan jarri."
						]
                    },
					{
                        "izena": "Kalitatearen kontrola",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
							"Barne diseinuko proiektuetan kalitate-kontrolaren kudeaketaren egitura eta elementu esanguratsuak identifikatzea."
							"Barne diseinuko -proiektuei lotutako kalitate-kontroleko planak diseinatzea.
							"Barne diseinuko obrak burutzeko zuzendaritza lanetan eskatzen diren dokumentuen kudeaketa eta kalitate-kontroleko prozedura simulatzea."
							"Arazoak modu autonomoan ebaztea."
							"Lankidetzan eta elkarlanean lan egitea."
							"Datuak bildu eta bahetzean oinarritutako dokumentazio propioa sortzea."
							"Egindako lana ahoz eta grafikoki jakinaraztea, berariazko terminologia erabiliz."
						]

                    },
					{
                        "izena": "Eraikuntza III",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 5,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "Eraikin bateko eraikuntza-elementuak bereiztea eta zertarako diren eta bana-banaka zein beste elementu batzuekiko erlazioan nola erantzuten duten jakitea."
							"Eraikin baten egituraren funtzionamenduaren oinarrizko alderdiak zein diren jakitea."
							"Egiturazko elementu txikiak kalkulatzea."
							"Eraikuntza-arloko terminologia jakitea."
							"Eraikuntza-prozesuetarako aukerak alderatzeko eta egokiena hautatzea."
							"Eraikuntzaren esparruan oinarri teorikoa eta praktikoa lortzea, lanbide-jardunean erabiltzeko."
							"Eraikuntza-arazoak eta -xehetasunak indarreko araudiaren arabera konpontzeko oinarrizko ezagutzak bereganatzea."
							"Eraikuntza-materialen eta -elementuen erabilerari eta aplikazioari lotutako ingurumen alderdiak zein diren jakitea."
							"Eskura dauden informazio-bideak erabiltzea, merkatuan dauden eraikuntza-materialez ikertzeko."
                        ]
                    },
                    {
                        "izena": "Eraikuntza IV",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 5,
                        "arloa": "DERAIKUNTZA ETA TEKNOLOGIA",
						"currentOfficialRAs": [
                            "Eraikuntzan baliatzen diren iragazgaizte-sistemak eta isolamenduak zer diren eta nola erabiltzen diren jakitea."
							"Eraikinaren inguratzailea osatzen duten elementuei buruzko teoria eta praktika jakitea."
							"Eraikinak konpartimentutan zatitzeko eraikuntza-elementuak ondo erabiltzea."
							"Eraikin batean dauden mailen arteko komunikazioa konpontzea."
							"Eraikuntza-arloko terminologia jakitea."
							"Eraikuntza-prozesuetarako aukerak alderatzea eta egokiena hautatzea."
							"Eraikuntzaren esparruan oinarri teorikoa eta praktikoa lortzea, lanbide-jardunean erabiltzeko."
							"Eraikuntza-arazoak eta -xehetasunak indarreko araudiaren arabera konpontzeko oinarrizko ezagutzak bereganatzea."
							"Eraikuntza-materialen eta -elementuen erabilerari eta aplikazioari lotutako ingurumen alderdiak zein diren	jakitea."
							"Eskura dauden informazio-bideak erabiltzea, merkatuan dauden eraikuntza-materialez ikertzeko."
                    }
                ],
                    {
                        "izena": "Akustika eta argiztapena",
                        "mota": "Hautazkoa",
                        "kredituak": 3,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
						"currentOfficialRAs": [
							"Akustikaren eta argiaren egokitzapena arautzen duten oinarri fisikoak ulertzea."
							"Akustika egokitzeko eta zaratatik babesteko sistemen eta materialen terminologia, ezaugarriak eta portaera ezagutzea."
							"Argiztapen-instalazioen material eta osagaien terminologia, ezaugarriak eta portaera ezagutzea."
							"Instalazio horiek arautzen dituen lege- eta erregelamendu-esparrua ulertzea eta indarrean dauden arauak betetzen dituzten irtenbideak hartzea."
							"Barrualdeak diseinatzeko proiektuak sortzea eta garatzea, espazioen kalitatea eta erabilera hobetzea dakarten irizpideekin."
							"Barne-diseinuko proiektuan irtenbide funtzional, formal eta teknikoak sortzea eta gauzatzea."
							"Proiektuak gauzatzeari buruzko informazioa aztertzea, interpretatzea, egokitzea eta ekoiztea."
							"Metodologia eta proposamenak sektorearen berezko teknologia- eta industria-bilakaerara egokitzea."
							"Ingurumenaren aldetik jasangarriak diren irtenbideak aurkitzea, bai eta ongizatearen ideia berriak ere."
							"Prozesuak ezagutzea eta norberaren esku-hartzea beste profesionalekin koordinatzen jakitea, sekuentzien eta bateragarritasun-mailen arabera."
						]
                    },
					{
                        "izena": "Girotze instalazioak",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 3,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "1. Ingurune-egokitzapenaren oinarrizko printzipioak ulertzea.",
                            "2. Argiztapen naturala eta artifiziala diseinatzea.",
                            "3. Sistema termikoak eta akustikoak ulertzea.",
                            "4. Aireztapen- eta klimatizazio-sistemak ezagutzea.",
                            "5. Efizientzia energetikoa eta jasangarritasuna kontuan hartzea.",
                            "6. Araudia eta estandarrak aplikatzea.",
                            "7. Teknologia berriak eta domotika ezagutzea."
                        ]
                    },
					{
                        "izena": "Diseinu bioklimatikoa",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "Ingurumen Jasangarria Sustatzeko Diseinu-Irtenbideak Aurkitzea: Ikasleak diseinu bioklimatikoan oinarritutako estrategiak aplikatzen ikasten du, ingurumenarekiko jasangarriak diren irtenbideak bilatzeko."
							"Diseinu Bioklimatikoaren Printzipioak Aplikatzea: Printzipio bioklimatikoak behar bezala interpretatzen eta aplikatzen ditu diseinuaren prozesuan, ingurumen-inpaktu txikiagoa lortzeko."
							"Erosotasun Termikoa Eta Energia Eraginkortasuna Ulertzea: Eraikinen diseinuak giza erosotasuna eta energia-eraginkortasuna nola eragiten duen identifikatzen eta aplikatzen du."
							"Eguzki-Diseinu Pasiboko Estrategiak Bereganatzea: Eguzki-diseinu pasiboaren teknikak erabiltzen ditu, hala nola isolamendua, argiztapena eta aireztapen naturala, energia-kontsumoa murrizteko."
							"Materialen eta Teknologien Ezagutza eta Aukeraketa: Diseinu bioklimatikoan erabilitako materialak eta teknologia berritzaileak aztertzen eta hautatzen ditu ingurumen-beharren arabera."
							"Eraikuntza-Irtenbide Jasangarriak Proiektatzea: Eraikinen ingurumen-beharrak asetzeko diseinu estrategiak garatzen ditu, energia aurrezteko eta iraunkortasuna bermatzeko."
							"Energia-Kontsumoa Murrizteko Neurriak Proposatzea:	Eraikinen energia-kontsumoa optimizatzeko neurriak aztertzen eta aplikatzen ditu, hala nola, beroa biltegiratzeko eta aireztapena hobetzeko sistemak."
							"Klimaren eta Tokiko Baliabideen Egokitzapena: Tokiko klima-baldintzen azterketa egiten du, horren arabera diseinu egokienak garatzeko."
							"Zero Energia Eraikinen Printzipioak Integratzea: Zero energia garbiko eraikinen diseinurako estrategia mailakatuak garatzen eta aplikatzen ditu."
                        ]
                    },
                    {
                        "izena": "Proiektuen Komunikazioa I",
                        "mota": "Hautazkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
						"currentOfficialRAs": [
                            "Proiektuen irudikapena eta komunikazioa hartzaileari eta testuingurura egokitu."
							"Hizkuntza unibertsala eta adierazpen baliabide/tresnak menderatu."
							"Proiektuen alderdi konplexuak sinplifikatu eta argitu eskuz irudikatzeko eta irudikapen digitaleko baliabideak	erabiliz."
							"Konposizio-irudi eta estilo pertsonalizatua eta bereizgarria sortu."
                        ]
                    }
					},
					{
                        "izena": "Home Staging",
                        "mota": "Hautazkoa",
                        "kredituak": 6,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "Etxebizitza baten balizko eroslearen profila aztertu eta identifikatzea.",
                            "Etxebizitza baten indarguneak eta ahulguneak aztertu eta identifikatzea, higiezinen merkatuan duen balioa ebaluatzeko.",
                            "Home Staging-aren estrategiak eta jarduteko printzipioak ezagutzea.",
                            "Relooking-aren estrategiak eta jarduteko printzipioak ezagutzea.",
                            "Home Stager baten lan-metodologia eta beharrezko baliabideak ezagutzea.",
                            "Etxebizitza jakin baterako Home Staging proposamen bat diseinatzea.",
                            "Home Staging proposamen bat komunikatu eta baloratzeko beharrezko dokumentazioa prestatzea.",
                            "Home Staging Birtual baterako proposamena garatzea."
							"Etxebizitzaren merkatuan interesa areagotzeko banaketa posibleak aztertzea."
							"Erosketa-salmenta prozesuen oinarrizko alderdiak ezagutzea."
							"Alokairu-prozesuen oinarrizko alderdiak ezagutzea."
							"Salgai dagoen etxebizitza baterako merkatuarekin bat datorren prezioa ezartzea."
                        ]
                    },
                    {
                        "izena": "Camperization in a camper van",
                        "mota": "Hautazkoa",
                        "kredituak": 6,
                        "arloa": "ERAIKUNTZA ETA TEKNOLOGIA",
                        "currentOfficialRAs": [
                            "Espazio Txikien Diseinuaren Printzipioak Ulertzea: Ikasleak kanpin-furgoneten habitagarritasuna eta eguneroko bizitzarako beharrezkoak diren oinarrizko estandarrak identifikatzen eta sailkatzen ditu."
							"Camperizazio Proiekturako Materialak eta Teknikak Ezagutzea: Material, sistema eta teknika desberdinak aztertzen eta aplikatzen ditu, diseinu iraunkorra eta funtzionala bermatzeko."
							"Espazioaren Antolaketarako Plangintza Estrategikoak Erabiltzea:	Proiektuaren garapen fase bakoitza planifikatzen eta baliabide teknologikoak egokitzen ditu (CNC makinak, laser ebakitzaileak, 3D inprimagailuak)."
							"Diseinu Ergonomiko eta Funtzionala Sortzea:	Mugikortasuneko etxebizitza baten barruko altzariak eta banaketa optimizatzen ditu, espazioaren aprobetxamendu maximoa lortzeko."
							"Aurrekontu Orokorra Zehaztea eta Egiaztatzea: Camperizazio-proiektu baten hasierako aurrekontua prestatzen eta egiaztatzen du, behar tekniko eta ekonomikoekin bat etorriz."
							"Bezeroaren Beharretara Egokitutako Diseinua Sortzea: Bezeroaren bizi-estilo eta beharrak definitzen ditu, diseinu pertsonalizatua eta egokitutako irtenbideak proposatzeko."
							"Maketa 1:1 Eskalan Eraikitzea eta Material Errealak Erabiltzea:	Kanpin-furgonetaren barruko diseinu bat gauzatzen du, eskala errealean eta material errealekin esperimentatuz."
							"Komunikazio Grafikoa eta Teknikoa Garatzea:	Diseinu-proiektua dokumentatzeko eta aurkezteko plano teknikoak, 3D ereduak eta eskemak garatzen ditu."
							"Segurtasun eta Arriskuen Kudeaketa:	Tresna mekanikoak eta makinak modu seguruan erabiltzen ikasten du, laneko arriskuak prebenitzeko arauak jarraituz."
							"Energia eta Baliabideen Erabilpen Jasangarria Aplikatzea: Eguzki-panelak, aireztapena eta isolamendu termikoa bezalako elementuak aztertzen eta diseinatzen ditu, energia-eraginkortasuna bermatzeko."
                        ]
                    }
                ],
                "4": [
                    {
                        "izena": "Diseinu eszenikoa eta ekitaldiak I",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "1. Diseinuko proiektuak eta aurreproiektuak ematea eta planifikatzea, baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera.",
                            "2. Proiektuak garatzea baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera.",
                            "3. Hizkuntza formalaren eta hizkuntza sinbolikoaren arteko harremanak ulertzea.",
                            "4. Hizkuntza formalaren eta sinbolikoaren erlazioak berariazko funtzionaltasunean integratzea.",
                            "5. Teknologiaren eta artearen, ideien eta helburuen, kulturaren eta merkataritzaren arteko bitartekari gisa jardutea.",
                            "6. Ikerketako eta berrikuntzako estrategiak planteatzea, funtzioetan, beharretan eta materialetan oinarritutako itxaropen berriak ebazteko.",
                            "7. Diseinatutako produktuak kultura-balioak transmiti ditzan lortzea, balio horiek tokikoak, eskualdekoak edo nazioz gaindikoak izan.",
                            "8. Gaur egun sortzen diren faktore sozial, estetiko eta artistikoak erabiltzea etorkizuneko joerak bideratzeko.",
                            "9. Komunikazio-moduen baliabide teknologikoak menderatzea.",
                            "10. Ikerketaren berezko prozedura metodologikoak menderatzea."
                        ]
                    },
                    {
                        "izena": "Diseinu eszenikoa eta ekitaldiak II",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 4,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
						"currentOfficialRAs": [
                            "1. Diseinuko proiektuak eta aurreproiektuak ematea eta planifikatzea, baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera.",
                            "2. Proiektuak garatzea baldintza tekniko, funtzional, estetiko eta komunikatiboen arabera.",
                            "3. Hizkuntza formalaren eta hizkuntza sinbolikoaren arteko harremanak ulertzea.",
                            "4. Hizkuntza formalaren eta sinbolikoaren erlazioak berariazko funtzionaltasunean integratzea.",
                            "5. Teknologiaren eta artearen, ideien eta helburuen, kulturaren eta merkataritzaren arteko bitartekari gisa jardutea.",
                            "6. Ikerketako eta berrikuntzako estrategiak planteatzea, funtzioetan, beharretan eta materialetan oinarritutako itxaropen berriak ebazteko.",
                            "7. Diseinatutako produktuak kultura-balioak transmiti ditzan lortzea, balio horiek tokikoak, eskualdekoak edo nazioz gaindikoak izan.",
                            "8. Gaur egun sortzen diren faktore sozial, estetiko eta artistikoak erabiltzea etorkizuneko joerak bideratzeko.",
                            "9. Komunikazio-moduen baliabide teknologikoak menderatzea.",
                            "10. Ikerketaren berezko prozedura metodologikoak menderatzea."
                        ]
                    },
                    {
                        "izena": "Lanen kudeaketa eta kontrola",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
                            "Barne diseinuko proiektu baten elementu esanguratsuak definitzea, arrakasta izateko egin eta lortu behar denari dagokionez."
							"Barne-diseinuko obra baten plangintza eta kudeaketa diseinatzea, baliabide grafiko zein digitalen bidez."
							"Barne-diseinuko proiektu gauzatzearen simulazioa abiaraztea (azterketa profesionalaren kudeaketa barne),baliabideen eta sor daitezkeen gatazken kudeaketa onean oinarrituta."
							"Barne-diseinuko proiektuen monitorizazioa simulatzea, haien kontrolaren bidez, plangintzaren arabera garatzen ari direla bermatzeko, eta, hala ez balitz, kontingentzia-plana aktibatuz, bideratzeko eta entregatzeko, eta, horrela, proiektuaren balio-bizitza ixtea."
							"Arazoak modu autonomoan eta arduratsuan ebaztea."
							"Lankidetzan eta lankidetzan lan egitea."
							"Datuak bildu eta bahetzean oinarritutako berezko dokumentazioa sortzea."
							"Egindako lana ahoz eta grafikoki jakinaraztea, berariazko terminologia erabiliz."
                        ]
                    },
					{
                        "izena": "Proiektua eta dokumentazioa",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 2,
                        "arloa": "KUDEAKETA ETA PROFESIONALTASUNA",
						"currentOfficialRAs": [
                            "Proiektuaren parte diren idatzizko dokumentuen prestatzea."
							"Proiektuak izan behar duen dokumentazio grafikoa identifikatzea."
							"Proiektuaren memoria deskribatzailea eta eraikitze memoria prestatzea."
							"Proiektuari eragiten dion hirigintza-araudia ezagutu eta justifikatzea."
							"Proiektuaren idatzizko dokumentazioan hondakinen kudeaketaren azterlana integratzea."
							"Proiektuaren idatzizko dokumentazioan kalitatea kontrolatzeko planaren idatzia integratzea."
							"Proiektuaren idatzizko dokumentazioan baldintza agiria-ren idatzia integratzea."
							"Proiektuaren idatzizko dokumentazioan neurketak eta aurrekontua integratzea."
							"Memoriak egiteko beharrezko diren tresna informatikoak erabiltzea."
							"Proiektua behar bezala definitzeko beharrezkoa den dokumentazio grafikoa aukeratzea."
							"Proiektua behar bezala definitzeko beharrezkoa den idatzizko dokumentazioa aukeratzea."
							"Teknologia berriak erabiltzea proiektua gauzatzen laguntzeko."
                        ]
                    },
					{
                        "izena": "Maketagintza birtuala",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
                        "currentOfficialRAs": [
                            "Infografia-bitartekoak erabiltzeko, interiorismo-proiektuen irudikapenean sakontzeko."
							"Infografia-bitartekoak erabiltzeko, ideia arkitektonikoak aztertzeko eta aurkezteko."
							"Diseinuaren eta interiorismo-proiektuen azterketan animazio infografikoak zer aukera dituen jakiteko."
							"Hiru dimentsioko birsorkuntzarako hizkuntza informatikoa jakiteko eta aplikatzeko.
							"Arkitektura-irudikapen grafikorako programa informatikoen erabileran sakontzeko.
							"Infografiak zer aukera eta muga dituen jakiteko.
							"Infografia-bitartekoak aukeratzeko eta erabiltzeko behar adina irizpide izateko eta lan bakoitzaren helburua lortzeko programa egokiena aukeratzeko."
							"Programen artean zer komunikazio-ahalmen dagoen jakiteko."
							"Merkatuko programen ezaugarriak aztertzeko eta beren arteko aldeak bereizteko."
							"Ordenagailuz lagundutako marrazketarako laguntza informatikoez Interneten ikertzeko."
                        ]
                    },
                    {
                        "izena": "Visual Merchadising",
                        "mota": "Hautazkoa",
                        "kredituak": 10,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
						"currentOfficialRAs": [
                            "Visual Merchandising delakoaren kontzeptu nagusiak ezagutzea eta identifikatzea."
							"Marka-irudia merkataritza- edo erakusketa-gune batean aplikatzea."
							"Target bezeroa (objektiboa) identifikatzea eta aztertzea, haren beharrak eta nahiak ulertzeko."
							"Bezeroa eta marka identifikatzearen garrantzia ulertzea."
							"Salmenta-espazio baten atmosferak erosketa-esperientzia gogoangarri bat sortzeko eragile	erabakigarri gisa duen rola ulertzea."
							"Erakusketa-espazio horizontala eta bertikala bereiztea."
							"Salgune bakoitzaren diseinu optimoa aurkitzeko aplikatu beharreko espazio- eta erakusketa-estrategiak ezagutzea."
							"Salmenta-azaleraren diseinua aztertzea, azalera osoan zirkulazio-fluxuak sor ditzan, elementuak espazioan modu eroso, logiko eta ordenatuan banatuz."
							"Espazioetan atmosferak sortzea, eskaintza komunikatu eta baloratzeko."
							"Produktuak azaltzerakoan istorioak kontatzen dituzten eszenografiak asmatzea."
                        ]
                    },
					{
                        "izena": "Proiektuen komunikazio aurreratua",
                        "mota": "Hautazkoa",
                        "kredituak": 6,
                        "arloa": "DISEINUAREN IKUS-ADIERAZPENA",
						"currentOfficialRAs": [
                            "Proiektuen aurkezpenean hizkuntza bisuala eta narratiba grafikoa lantzea."
							"Dokumentuak, aurkezpenak eta panelak maketatzean ikaslearen berezko estiloa definitzea."
							"Maketaziorako eta argitalpen-diseinurako baliabide teknologikoen eta tresna digitalen erabileran sakontzea."
							"Produkzioaz edo ideiaz haratago joatea, mezua transmititzen eta teknika desberdinak eta horietako bakoitzak proiektuen maketazioan duen garrantzia baloratu ahal izatea."
							"Ekoizpenetik edo ideiatik harago pentsatzen saiatzea, mezuaren transmisioan sakonduz eta teknika desberdinak eta horietako bakoitzak proiektuen maketazioan duen garrantzia baloratuz."
							"Proiektuak modu profesionalean eta eraginkorrean aurkezteko beharrezko gaitasunak ematea."
						]
                    },
					{
                        "izena": "Praktikak enpresan",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 18,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "Enpresa-errealitatearen ezagutza praktikoa eskuratzea, barne-diseinuaren sektorean aplikatutako lan-prozesuak, rol profesionalak eta lan-inguruneak identifikatuz."
							"Diseinu-proiektu errealetan parte hartzea, bezeroekin, hornitzaileekin eta talde multidiziplinarrekin lankidetzan arituz."
							"Diseinuaren aplikazio profesionala ulertzea, araudi teknikoak, jasangarritasun-irizpideak eta ergonomia kontuan hartuta."
							"Lan-prozesuen dokumentazioa eta komunikazioa menderatzea, planoak, aurkezpenak eta txosten teknikoak sortuz."
							"Diseinuaren inpaktu soziala eta ingurumenekoa baloratzea, GJHekin lerrokatutako praktika arduratsuak identifikatuz (adib. GJH 12: Kontsumo eta ekoizpen arduratsua; GJH 9: Industria, berrikuntza eta azpiegitura)."
							"Autonomia eta erantzukizuna garatzea, lan-ingurune profesional batean eguneroko erronkei aurre eginez."
							"Talde-lanerako eta komunikazio eraginkorrerako gaitasuna indartzea, enpresa-dinamikan parte hartuz."
							"Etengabeko ikaskuntzarako jarrera aktiboa erakustea, feedback profesionala jasoz eta aplikatuz."
							"Etika profesionala eta gizarte-konpromisoa sustatzea, diseinuaren bidez komunitateari ekarpen positiboa eginez (GJH 10: Desberdintasunak murriztea; GJH 11: Hiri eta komunitate jasangarriak)."
							"Lan-ingurune inklusibo eta jasangarrietan aritzeko gaitasuna garatzea, irisgarritasun, berdintasun eta jasangarritasun irizpideak aplikatuz (GJH 5: Genero berdintasuna; GJH 13: Klima-ekintza)."
                        ]
                    },
                    {
                        "izena": "Gradu Amaierako Lana",
                        "mota": "Derrigorrezkoa",
                        "kredituak": 18,
                        "arloa": "DISEINU PROIEKTUAK ETA METODOLOGIAK",
                        "currentOfficialRAs": [
                            "Norberaren erabakiak hartzea eta bere ondorioez arduratzea, irizpide propioa izatea eta bere denbora kudeatzea.",
                            "Diseinuaren ideiarekin koherenteak diren giroak proiektatzea (materialak, formak, ehundurak, argia eta kolorea, akustika).",
                            "Modu esanguratsuan eta efizientean erantzutea proiektuaren baldintzatzaileei eta eskakizunei, espazioen konposizioaren eta horien bereizmen estetikoaren eremu espezifikotik.",
                            "Proiektuaren baldintzei eta eskakizunei modu esanguratsuan eta efizientean erantzutea, horien ebazpen teknikoaren eremu espezifikotik.",
                            "Barrualdeen proiektuaren testuinguru espezifikoa eta baldintzatzaileak aztertzea.",
                            "Ingurumen-irizpideak aplikatzea proiektuak ebaztean eta barneratze-obrak planifikatzean.",
                            "Irizpide sozialak aplikatzea, espazioek irisgarritasun unibertsalaren baldintzak bete ditzaten.",
                            "Proiektuaren faseak planifikatzea eta kudeatzea."
                        ]
                    }
                ],
            "Diseinu Grafikoko Goi Mailako Arte Irakaskuntzetako Gradua": {
                "1": [],
                "2": [],
                "3": [],
                "4": []
            },
            "Modako Diseinuko Goi Mailako Arte Irakaskuntzetako Gradua": {
                "1": [],
                "2": [],
                "3": [],
                "4": []
            },
            "Produktuen Diseinuko Goi Mailako Arte Irakaskuntzetako Gradua": {
                "1": [],
                "2": [],
                "3": [],
                "4": []
            }
    }
